uhnp/src/InformationRegisters/АналитикаПланированияСтатейБюджетов/АналитикаПланированияСтатейБюджетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АналитикаПланированияСтатейБюджетов</name>
  <resources>
    <name>КлючАналитики</name>
    <type>
      <types>CatalogRef.КлючиАналитикиПланированияСтатейБюджетов</types>
    </type>
  </resources>
  <dimensions>
    <name>СтатьяБюджета</name>
    <type>
      <types>Characteristic.ВидыБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика1</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика2</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика3</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика4</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика5</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика6</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПриходРасход</name>
    <type>
      <types>EnumRef.ВидыДвиженийПриходРасход</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/АналитикаПланированияСтруктуры/АналитикаПланированияСтруктуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АналитикаПланированияСтруктуры</name>
  <resources>
    <name>КлючАналитики</name>
    <type>
      <types>CatalogRef.КлючиАналитикиПланированияСтруктуры</types>
    </type>
  </resources>
  <dimensions>
    <name>ЦФО</name>
    <type>
      <types>DefinedType.ЦФО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/АналитикаКонтроляБюджетныхЛимитовРезервов/АналитикаКонтроляБюджетныхЛимитовРезервов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АналитикаКонтроляБюджетныхЛимитовРезервов</name>
  <resources>
    <name>КлючАналитики</name>
    <type>
      <types>CatalogRef.КлючиКонтроляБюджетныхЛимитовРезервов</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидБюджета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаПланированияСтатейБюджетов</name>
    <type>
      <types>CatalogRef.КлючиАналитикиПланированияСтатейБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаПланированияСтруктуры</name>
    <type>
      <types>CatalogRef.КлючиАналитикиПланированияСтруктуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументРезервирования</name>
    <type>
      <types>DefinedType.ОбъектыПланирования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НачалоПериодаКонтроля</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодичностьКонтроля</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ПараметрыЛимитирования/ПараметрыЛимитирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыЛимитирования</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ПериодичностьПланирования</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </resources>
  <resources>
    <name>ПериодичностьЛимитирования</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоПериодовЛимитирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьЛимитирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьРезервирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпособОпределенияВалютыЛимитирования</name>
    <type>
      <types>EnumRef.СпособыОпределенияВалютыЛимитирования</types>
    </type>
  </resources>
  <resources>
    <name>КонтрольЛимитов</name>
    <type>
      <types>EnumRef.РежимыКонтроляДокументов</types>
    </type>
  </resources>
  <resources>
    <name>КонтрольРезервов</name>
    <type>
      <types>EnumRef.РежимыКонтроляДокументов</types>
    </type>
  </resources>
  <resources>
    <name>УчитыватьАналитикиСтатьиБюджетаПриКонтроле</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВалютаПоУмолчанию</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>ПланированиеЗакупок</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РезервированиеВПериодичностиПланирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидБюджета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ПараметрыЛимитированияГруппыСтатей/ПараметрыЛимитированияГруппыСтатей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыЛимитированияГруппыСтатей</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ИнаяПериодичность</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </resources>
  <resources>
    <name>КонтрольПоГруппе</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИноеДействие</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтрольЛимитов</name>
    <type>
      <types>EnumRef.РежимыКонтроляДокументов</types>
    </type>
  </resources>
  <resources>
    <name>КонтрольРезервов</name>
    <type>
      <types>EnumRef.РежимыКонтроляДокументов</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидБюджета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГруппаСтатей</name>
    <type>
      <types>CatalogRef.ГруппыСтатейБюджета</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ПараметрыЛимитированияГруппыСтатейСостав/ПараметрыЛимитированияГруппыСтатейСостав.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыЛимитированияГруппыСтатейСостав</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ГруппаСтатей</name>
    <type>
      <types>CatalogRef.ГруппыСтатейБюджета</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидБюджета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяБюджета</name>
    <type>
      <types>Characteristic.ВидыБюджетов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ПараметрыКонтроляЛимитаСтатейБюджетов/ПараметрыКонтроляЛимитаСтатейБюджетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыКонтроляЛимитаСтатейБюджетов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>КонтролироватьСтатью</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтролироватьАналитику1</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтролироватьАналитику2</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтролироватьАналитику3</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтролироватьАналитику4</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтролироватьАналитику5</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтролироватьАналитику6</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИноеДействие</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтрольЛимитов</name>
    <type>
      <types>EnumRef.РежимыКонтроляДокументов</types>
    </type>
  </resources>
  <resources>
    <name>КонтрольРезервов</name>
    <type>
      <types>EnumRef.РежимыКонтроляДокументов</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидБюджета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяБюджета</name>
    <type>
      <types>Characteristic.ВидыБюджетов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/РежимыКонтроляДокументов/РежимыКонтроляДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РежимыКонтроляДокументов</name>
  <enumValues>
    <name>Блокировать</name>
  </enumValues>
  <enumValues>
    <name>Информировать</name>
  </enumValues>
  <enumValues>
    <name>НеКонтролировать</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/КлючиКонтроляБюджетныхЛимитовРезервов/КлючиКонтроляБюджетныхЛимитовРезервов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КлючиКонтроляБюджетныхЛимитовРезервов</name>
  <attributes>
    <name>ВидБюджета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаПланированияСтатейБюджетов</name>
    <type>
      <types>CatalogRef.КлючиАналитикиПланированияСтатейБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаПланированияСтруктуры</name>
    <type>
      <types>CatalogRef.КлючиАналитикиПланированияСтруктуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРезервирования</name>
    <type>
      <types>DefinedType.ОбъектыПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериодаКонтроля</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьКонтроля</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПредназначение</name>
    <type>
      <types>EnumRef.ПредназначенияЭлементовСтруктурыОтчета</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПериодЛимитирования</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/ChartsOfCharacteristicTypes/ВидыКонтроляДокументов/ВидыКонтроляДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыКонтроляДокументов</name>
  <type>
    <types>CatalogRef.КлючиКонтроляПоДоговорам</types>
    <types>CatalogRef.КлючиКонтроляОбъемаЗакупок</types>
    <types>CatalogRef.КлючиКонтроляЗадолженностиПоКонтрагенту</types>
    <types>CatalogRef.КлючиАналитикиПланированияРасчетовСКонтрагентами</types>
    <types>CatalogRef.КлючиКонтроляБюджетныхЛимитовРезервов</types>
  </type>
  <predefined>
    <items>
      <name>КонтрольБюджетныхЛимитов</name>
      <description>Контроль бюджетных лимитов</description>
      <code>000000001</code>
      <type>
        <types>CatalogRef.КлючиКонтроляБюджетныхЛимитовРезервов</types>
      </type>
    </items>
    <items>
      <name>КонтрольБюджетныхРезервов</name>
      <description>Контроль бюджетных резервов</description>
      <code>000000002</code>
      <type>
        <types>CatalogRef.КлючиКонтроляБюджетныхЛимитовРезервов</types>
      </type>
    </items>
    <items>
      <name>КонтрольМаксимальнойСуммыЗадолженностиПоДоговору</name>
      <description>Контроль задолженности по договору</description>
      <code>000000003</code>
      <type>
        <types>CatalogRef.КлючиКонтроляПоДоговорам</types>
      </type>
    </items>
    <items>
      <name>КонтрольОбщейЗадолженностиКонтрагента</name>
      <description>Контроль задолженности по контрагенту</description>
      <code>000000004</code>
      <type>
        <types>CatalogRef.КлючиКонтроляЗадолженностиПоКонтрагенту</types>
      </type>
    </items>
    <items>
      <name>КонтрольОбъемаЗакупок</name>
      <description>Контроль подтвержденного объема закупок</description>
      <code>000000006</code>
      <type>
        <types>CatalogRef.КлючиКонтроляОбъемаЗакупок</types>
      </type>
    </items>
    <items>
      <name>КонтрольРасходовПоДоговору</name>
      <description>Контроль расходов по договору</description>
      <code>000000005</code>
      <type>
        <types>CatalogRef.КлючиКонтроляПоДоговорам</types>
      </type>
    </items>
  </predefined>
  <attributes>
    <name>РежимКонтроля</name>
    <type>
      <types>EnumRef.РежимыКонтроляДокументов</types>
    </type>
  </attributes>
</mdclass:ChartOfCharacteristicTypes>

uhnp/src/CommonModules/КонтрольУХБюджетныеЛимиты/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Функция возвращает объект-проверку
Функция Создать() Экспорт
	
	Проверка = КонтрольУХ.Новый_Проверка();
	Проверка.Объект = КонтрольУХБюджетныеЛимиты;
	Проверка.Источник = ИмяИсточника();
	Проверка.ВидКонтроля = ПланыВидовХарактеристик.ВидыКонтроляДокументов.КонтрольБюджетныхЛимитов;
	Проверка.ИмяРеквизита = "ЕстьПревышениеЛимитыБюджет";
	Проверка.Вставить ("ПриЗагрузке", Истина);
	
	Возврат Проверка;
	
КонецФункции

// Возвращает имя источника для проверки
//
Функция ИмяИсточника() Экспорт
	
	Возврат "ИзменениеБюджетныхЛимитовРезервов";
	
КонецФункции

// Функция возвращает Истина, если для этого документа проверка выполняется
Функция ТребуетсяДляДокумента(ИмяДокумента) Экспорт

	Если ОбщегоНазначения.ПодсистемаСуществует("ПереопределяемыеОбъектыУП") Тогда
    	Значение = Истина;
	Иначе
		Значение = (Не ИмяДокумента = "ЗаказПоставщику");	
	КонецЕсли;
	
	Возврат Значение;

КонецФункции

// Функция возвращает Истина, если требуется выполнение проверки
Функция ТребуетсяПроверка(ПараметрыКонтроля, Источник) Экспорт
	Возврат Истина;
КонецФункции

// Функция выполняет обработку данных источника
Функция ОбработатьДанныеИсточника(ИнформацияДляКонтроля, Источник) Экспорт
	
	// Инициализируем запрос
	Запрос = Новый Запрос;
	Если Источник.Свойство("Параметры") И ТипЗнч(Источник.Параметры) = Тип("Структура") Тогда
		Для Каждого КлючЗначение Из Источник.Параметры Цикл
			Запрос.УстановитьПараметр(КлючЗначение.Ключ, КлючЗначение.Значение);
		КонецЦикла;
	КонецЕсли;
	
	ИмяВременнойТаблицы = "ВТ_ТаблицаПлановССуммамиЛимитирования";
	
	ПланыДокументаВМенеджереВременныхТаблиц = ТипЗнч(Источник.ПланыДокумента) = Тип("МенеджерВременныхТаблиц");
	Если ПланыДокументаВМенеджереВременныхТаблиц Тогда
		Запрос.МенеджерВременныхТаблиц = Источник.ПланыДокумента;
	Иначе
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		ОбщегоНазначенияОПК.ЗагрузитьТаблицуВоВременнуюТаблицуЗапроса(
			Запрос, 
			ИмяВременнойТаблицы,
			Источник.ПланыДокумента);
	КонецЕсли;
	
	КонтрольЛимитовУХ.ВыполнитьРасчетСуммЛимитированияДляКонтроля(Запрос.МенеджерВременныхТаблиц, ИмяВременнойТаблицы);
	КонтрольЛимитовУХ.ВыполнитьКонтрольЛимитов(Запрос, Источник.Параметры);
	
	РезультатКонтроля = КонтрольЛимитовУХ.СформироватьДанныеКонтроля(Запрос.МенеджерВременныхТаблиц, "ВТ_ТаблицаЛимитов", , Источник.Параметры);
	РезультатКонтроля.Колонки.Добавить("КонтрольНарушен", Новый ОписаниеТипов("Булево"));
	
	// Результат контроля резерва
	СтруктураПоиска = Новый Структура("ВидКонтроля", ПланыВидовХарактеристик.ВидыКонтроляДокументов.КонтрольБюджетныхРезервов);
	РезультатКонтроляРезервов = РезультатКонтроля.Скопировать(СтруктураПоиска);
	ИнформацияДляКонтроля.Вставить("РезультатКонтроляРезервов", РезультатКонтроляРезервов);
	
	// Результат контроля бюджета
	СтруктураПоиска = Новый Структура("ВидКонтроля", ПланыВидовХарактеристик.ВидыКонтроляДокументов.КонтрольБюджетныхЛимитов);
	РезультатКонтроляЛимитов = РезультатКонтроля.Скопировать(СтруктураПоиска);
	
	РассчитатьПревышениеРезерва(РезультатКонтроляЛимитов, РезультатКонтроляРезервов);
	
	Возврат РезультатКонтроляЛимитов;
	
КонецФункции

// Процедура выполняет контроль обработанных данных
Функция ВыполнитьКонтроль(ИнформацияДляКонтроля, ДанныеДляКонтроля) Экспорт
	
	КонтрольНарушен = Ложь;
	Для Каждого Строка Из ДанныеДляКонтроля Цикл
		
		// Расчет
		ДоступноДо = Окр(Строка.Лимит, 2) - Окр(Строка.Зарезервировано, 2) - Окр(Строка.Заявлено, 2) - Окр(Строка.Исполнено, 2);
		Если Окр(Строка.ЗаявленоИзменение, 2) > 0 И Окр(Строка.ЗарезервированоИзменение, 2) < 0 Тогда
			// Это заявка по резерву
			ТекущаяОперация = - Окр(Строка.ЗаявленоИзменение, 2);
			ТекущаяОперацияПревышениеРезерва = Окр(Строка.ЗарезервированоИзменениеПревышениеТекущегоРезерва, 2);
			ТекущаяОперацияИзРезерва = Окр(Строка.ЗарезервированоИзменение, 2) - Окр(ТекущаяОперацияПревышениеРезерва, 2);
		ИначеЕсли Окр(Строка.ЗарезервированоИзменение, 2) < 0 Тогда
			 //Это операция из резерва в резерв
			ТекущаяОперация = Окр(Строка.ЗарезервированоИзменение, 2);
			ТекущаяОперацияПревышениеРезерва = Окр(Строка.ЗарезервированоИзменениеПревышениеТекущегоРезерва, 2);
			ТекущаяОперацияИзРезерва = Окр(Строка.ЗарезервированоИзменение, 2) - Окр(ТекущаяОперацияПревышениеРезерва, 2);
		Иначе
			ТекущаяОперация = Окр(Строка.ЛимитИзменение, 2) - Окр(Строка.ЗарезервированоИзменение, 2) - Окр(Строка.ЗаявленоИзменение, 2) - Окр(Строка.ИсполненоИзменение, 2);
			ТекущаяОперацияИзРезерва = 0;
			ТекущаяОперацияПревышениеРезерва = 0;
		КонецЕсли;
		
		ДоступноПосле = ДоступноДо + ТекущаяОперация - ТекущаяОперацияИзРезерва;
					
		Строка.КонтрольНарушен = ДоступноПосле < 0;
		КонтрольНарушен = КонтрольНарушен ИЛИ Строка.КонтрольНарушен;
		
	КонецЦикла;
	
	Возврат КонтрольНарушен;
	
КонецФункции

// Функция возвращает Истина, если нарушение контроля должно приводить к блокированию проведения
Функция БлокироватьПроведение(КлючКонтроля) Экспорт
	Возврат БлокироватьПроведениеДляВидаКонтроля(КлючКонтроля);
КонецФункции

// Процедура возвращает табличный документ с расшифровкой контроля документа
//
Функция СформироватьРасшифровкуКонтроля(Проверка, СтрокаКонтроль) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ДанныеКонтроляИзХранилища = ПолучитьИзВременногоХранилища(СтрокаКонтроль.АдресРезультата);
	Если ТипЗнч(ДанныеКонтроляИзХранилища) <> Тип("ТаблицаЗначений") Тогда
		Возврат ТабличныйДокумент;
	КонецЕсли; 

	ДанныеКонтроля = ДанныеКонтроляИзХранилища.Скопировать();
	Если ДанныеКонтроля.Колонки.Найти("ПериодЛимитирования") = неопределено Тогда
		ДанныеКонтроля.Колонки.Добавить("ПериодЛимитирования", ОбщегоНазначения.ОписаниеТипаСтрока(20));
	КонецЕсли;
	
	Для Каждого Строка Из ДанныеКонтроля Цикл
		Строка.ПериодЛимитирования = ОбщегоНазначенияОПК.ПредставлениеПериодаПоПериодичности(
			Строка.НачалоПериодаКонтроля, Строка.ПериодичностьКонтроля);     		
	КонецЦикла;
	
	Измерения = "ВидБюджета, ПериодичностьКонтроля, НачалоПериодаКонтроля, ПериодЛимитирования";
	Ресурсы = "Лимит, ЛимитИзменение, Зарезервировано, ЗарезервированоИзменение, Заявлено, ЗаявленоИзменение, Исполнено, 
				|ИсполненоИзменение,ЗарезервированоИзменениеПревышениеТекущегоРезерва";
	
	ТаблицаВидБюджета = ДанныеКонтроля.Скопировать(,"ВидБюджета," + Ресурсы);
	ТаблицаВидБюджета.Свернуть("ВидБюджета", Ресурсы);

	ТаблицаПериодов = ДанныеКонтроля.Скопировать(, Измерения + "," + Ресурсы);
	ТаблицаПериодов.Свернуть(Измерения, Ресурсы);
	ТаблицаПериодов.Сортировать("НачалоПериодаКонтроля, ПериодичностьКонтроля");
	
	ИспользоватьРезервированиеФО = КонтрольЛимитовУХПовтИсп.ПолучитьЗначениеИспользованияРезервирования();
	
	Если ИспользоватьРезервированиеФО Тогда
		Макет = ПланыВидовХарактеристик.ВидыКонтроляДокументов.ПолучитьМакет("КонтрольЛимитовПоБюджетам");
	Иначе
		Макет = ПланыВидовХарактеристик.ВидыКонтроляДокументов.ПолучитьМакет("КонтрольЛимитовПоБюджетамРезервыОтключены");
	КонецЕсли;
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");	
	ШапкаТаблицы = ПолучитьОбластиОтчета(Макет, "ШапкаТаблицы", ИспользоватьРезервированиеФО);
	ПодвалТаблицы = ПолучитьОбластиОтчета(Макет, "ПодвалТаблицы", ИспользоватьРезервированиеФО);
	ГруппаВидБюджета = ПолучитьОбластиОтчета(Макет, "ГруппировкаВидБюджета", ИспользоватьРезервированиеФО);
	ГруппаПериод = ПолучитьОбластиОтчета(Макет, "ГруппировкаПериод", ИспользоватьРезервированиеФО);
	Детали = ПолучитьОбластиОтчета(Макет, "Детали", ИспользоватьРезервированиеФО);
	
	ТабличныйДокумент.Очистить();
	
	// Формирование заголовка
	ОбластьЗаголовок.Параметры.Документ = СтрокаКонтроль.Документ;
	ОбластьЗаголовок.Параметры.ДатаВремяКонтроля = СтрокаКонтроль.ВремяПроверки;
	ОбластьЗаголовок.Параметры.ТекущееВремя = ТекущаяДатаСеанса();
	ОбластьЗаголовок.Параметры.ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	
	ТабличныйДокумент.НачатьАвтогруппировкуСтрок();
	
	ВывестиОбластиОтчета(ТабличныйДокумент, ШапкаТаблицы, , ИспользоватьРезервированиеФО);
	
	Для Каждого СтрокаВидБюджета Из ТаблицаВидБюджета Цикл
		
		ЗаполнитьСуммыВОбласти(ГруппаВидБюджета, СтрокаВидБюджета, ИспользоватьРезервированиеФО, СтрокаКонтроль.Документ);
		ВывестиОбластиОтчета(ТабличныйДокумент, ГруппаВидБюджета, 1, ИспользоватьРезервированиеФО);
		
		СтрокиПериодов = ТаблицаПериодов.НайтиСтроки(Новый Структура("ВидБюджета", СтрокаВидБюджета.ВидБюджета));

		СтруктураПоиска = Новый Структура("ВидБюджета, ПериодичностьКонтроля, НачалоПериодаКонтроля");
		Для Каждого СтрокаПериод Из СтрокиПериодов Цикл
			
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаПериод);
			СтрокиОтчета = ДанныеКонтроля.НайтиСтроки(СтруктураПоиска);
			
			ЗаполнитьСуммыВОбласти(ГруппаПериод, СтрокаПериод, ИспользоватьРезервированиеФО, СтрокаКонтроль.Документ);
			
			ВывестиОбластиОтчета(ТабличныйДокумент, ГруппаПериод, 2, ИспользоватьРезервированиеФО);
			Для Каждого ВыборкаДетальныеЗаписи Из СтрокиОтчета Цикл
				ЗаполнитьСуммыВОбласти(Детали, ВыборкаДетальныеЗаписи, ИспользоватьРезервированиеФО, СтрокаКонтроль.Документ);
				
				Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Проект) Тогда
					Детали.Начало.Параметры.Проект = НСтр("ru = '<без проекта>'");
				КонецЕсли;
				
				Если ДанныеКонтроля.Колонки.Найти("КонтрольЛимитов") = Неопределено ИЛИ НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.КонтрольЛимитов) Тогда
					Детали.Начало.Параметры.КонтрольЛимитов = НСтр("ru = '<не удалось определить, необходимо перевыполнить контроль в документе>'");
				КонецЕсли;
				
				ВывестиОбластиОтчета(ТабличныйДокумент, Детали, 3, ИспользоватьРезервированиеФО);
			КонецЦикла;

		КонецЦикла;  
		
	КонецЦикла;
	
	ТабличныйДокумент.ЗакончитьАвтогруппировкуСтрок();
	
	ВывестиОбластиОтчета(ТабличныйДокумент, ПодвалТаблицы, , ИспользоватьРезервированиеФО);
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Процедура сохраняет данные для контроля в табличной части документа
//
// Параметры:
//  ДанныеДляКонтроля	- Таблица значений	- Результат контроля
//  РезультатыКонтроля	- ТабличнаяЧасть	- табличная часть РезультатыКонтроля проверяемого документа
//
Процедура СохранитьДанныеДляКонтроляВДокументе(ДанныеДляКонтроля, РезультатыКонтроля) Экспорт
	
	// НомерСтроки
	Если ДанныеДляКонтроля.Колонки.Найти("НомерСтроки") = неопределено Тогда
		ДанныеДляКонтроля.Колонки.Добавить("НомерСтроки", ОбщегоНазначения.ОписаниеТипаЧисло(10,0));
		Поз = 1;
		Для Каждого Строка Из ДанныеДляКонтроля Цикл
			Строка.НомерСтроки = Поз;
			Поз = Поз + 1;
		КонецЦикла;
	КонецЕсли;
	
	// АналитикаПланированияСтатейБюджетов
	Если ДанныеДляКонтроля.Колонки.Найти("АналитикаПланированияСтатейБюджетов") = неопределено Тогда
		ДанныеДляКонтроля.Колонки.Добавить("АналитикаПланированияСтатейБюджетов", Новый ОписаниеТипов("СправочникСсылка.КлючиАналитикиПланированияСтатейБюджетов"));
	КонецЕсли;
	ИменаПолей = РегистрыСведений.АналитикаПланированияСтатейБюджетов.ИменаПолейКоллекцииПоУмолчанию();
	Если ТипЗнч(ДанныеДляКонтроля) = Тип("ТаблицаЗначений") Тогда
		Если ДанныеДляКонтроля.Колонки.Найти("ПриходРасход") = Неопределено Тогда
			ИменаПолей.ПриходРасход = "";		 
		КонецЕсли;
	Иначе
		ИменаПолей.ПриходРасход = "";	 
	КонецЕсли;
	РегистрыСведений.АналитикаПланированияСтатейБюджетов.ЗаполнитьВКоллекции(ДанныеДляКонтроля, ИменаПолей);
	
	// АналитикаПланированияСтруктуры
	Если ДанныеДляКонтроля.Колонки.Найти("АналитикаПланированияСтруктуры") = неопределено Тогда
		ДанныеДляКонтроля.Колонки.Добавить("АналитикаПланированияСтруктуры", Новый ОписаниеТипов("СправочникСсылка.КлючиАналитикиПланированияСтруктуры"));
	КонецЕсли;
	ИменаПолей = РегистрыСведений.АналитикаПланированияСтруктуры.ИменаПолейКоллекцииПоУмолчанию();
	ИменаПолей.Организация = "";
	РегистрыСведений.АналитикаПланированияСтруктуры.ЗаполнитьВКоллекции(ДанныеДляКонтроля, ИменаПолей);
	
	// АналитикаКонтроляБюджетныхЛимитовРезервов
	Если ДанныеДляКонтроля.Колонки.Найти("КлючКонтроля") = неопределено Тогда
		ДанныеДляКонтроля.Колонки.Добавить("КлючКонтроля", Новый ОписаниеТипов("СправочникСсылка.КлючиКонтроляБюджетныхЛимитовРезервов"));
	КонецЕсли;
	ИменаПолей = РегистрыСведений.АналитикаКонтроляБюджетныхЛимитовРезервов.ИменаПолейКоллекцииПоУмолчанию();
	ИменаПолей.АналитикаКонтроляБюджетныхЛимитовРезервов = "КлючКонтроля";
	РегистрыСведений.АналитикаКонтроляБюджетныхЛимитовРезервов.ЗаполнитьВКоллекции(ДанныеДляКонтроля, ИменаПолей);
	
	Для Каждого Строка Из ДанныеДляКонтроля Цикл
		ЗаполнитьЗначенияСвойств(РезультатыКонтроля.Добавить(), Строка);
	КонецЦикла;
	
КонецПроцедуры // СохранитьДанныеДляКонтроляВДокументе()

// Функция возвращает соответствие с описанием колонок таблицы данных контроля, которые получаются из ключа контроля
//
// Возвращаемое значение:
//   Соответствие   - {ИмяКолонки, Структура("ИмяКолонки, ОписаниеТипа, ПутьКДанным")}
//
Функция КолонкиДанныхКонтроля() Экспорт
	
	Колонки = Новый Соответствие;
	КонтрольУХ.ДобавитьКолонкуКонтроля(Колонки, 
		"ВидБюджета",
		Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ВидыБюджетов"));
	КонтрольУХ.ДобавитьКолонкуКонтроля(Колонки, 
		"ДокументРезервирования",
		Метаданные.ОпределяемыеТипы.ОбъектыПланирования.Тип);
	КонтрольУХ.ДобавитьКолонкуКонтроля(Колонки, 
		"ПериодичностьКонтроля",
		Новый ОписаниеТипов("ПеречислениеСсылка.Периодичность"));
	КонтрольУХ.ДобавитьКолонкуКонтроля(Колонки, 
		"НачалоПериодаКонтроля",
		ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	КонтрольУХ.ДобавитьКолонкуКонтроля(Колонки, 
		"ЦФО",
		Метаданные.ОпределяемыеТипы.ЦФО.Тип,
		"АналитикаПланированияСтруктуры.ЦФО");
	КонтрольУХ.ДобавитьКолонкуКонтроля(Колонки, 
		"Проект",
		Новый ОписаниеТипов("СправочникСсылка.Проекты"),
		"АналитикаПланированияСтруктуры.Проект");
	КонтрольУХ.ДобавитьКолонкуКонтроля(Колонки, 
		"СтатьяБюджета",
		Метаданные.ПланыВидовХарактеристик.ВидыБюджетов.Тип,
		"АналитикаПланированияСтатейБюджетов.СтатьяБюджета");
	КонтрольУХ.ДобавитьКолонкуКонтроля(Колонки, 
		"Аналитика1",
		Метаданные.ПланыВидовХарактеристик.ВидыСубконтоКорпоративные.Тип,
		"АналитикаПланированияСтатейБюджетов.Аналитика1");
	КонтрольУХ.ДобавитьКолонкуКонтроля(Колонки, 
		"Аналитика2",
		Метаданные.ПланыВидовХарактеристик.ВидыСубконтоКорпоративные.Тип,
		"АналитикаПланированияСтатейБюджетов.Аналитика2");
	КонтрольУХ.ДобавитьКолонкуКонтроля(Колонки, 
		"Аналитика3",
		Метаданные.ПланыВидовХарактеристик.ВидыСубконтоКорпоративные.Тип,
		"АналитикаПланированияСтатейБюджетов.Аналитика3");
	КонтрольУХ.ДобавитьКолонкуКонтроля(Колонки, 
		"Аналитика4",
		Метаданные.ПланыВидовХарактеристик.ВидыСубконтоКорпоративные.Тип,
		"АналитикаПланированияСтатейБюджетов.Аналитика4");
	КонтрольУХ.ДобавитьКолонкуКонтроля(Колонки, 
		"Аналитика5",
		Метаданные.ПланыВидовХарактеристик.ВидыСубконтоКорпоративные.Тип,
		"АналитикаПланированияСтатейБюджетов.Аналитика5");
	КонтрольУХ.ДобавитьКолонкуКонтроля(Колонки, 
		"Аналитика6",
		Метаданные.ПланыВидовХарактеристик.ВидыСубконтоКорпоративные.Тип,
		"АналитикаПланированияСтатейБюджетов.Аналитика6");
		
	Результат = Новый Структура;
	Результат.Вставить("Источник", "Справочник.КлючиКонтроляБюджетныхЛимитовРезервов");
	Результат.Вставить("Колонки", Колонки);
	
	Возврат Результат;
	
КонецФункции

//
Функция БлокироватьПроведениеДляВидаКонтроля(КлючиКонтроля) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КлючиКонтроля", КлючиКонтроля);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Ключи.Ссылка КАК КлючКонтроля,
	|	Ключи.Ссылка.ВидБюджета КАК ВидБюджета,
	|	Ключи.Ссылка.АналитикаПланированияСтатейБюджетов.СтатьяБюджета КАК ОбъектКонтроля,
	|	МАКСИМУМ(ПараметрыЛимитирования.Период) КАК НачалоДействия
	|ПОМЕСТИТЬ ВТ_КлючиКонтроляСНачаломДействия
	|ИЗ
	|	Справочник.КлючиКонтроляБюджетныхЛимитовРезервов КАК Ключи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыЛимитирования КАК ПараметрыЛимитирования
	|		ПО Ключи.ВидБюджета = ПараметрыЛимитирования.ВидБюджета
	|ГДЕ
	|	Ключи.Ссылка В(&КлючиКонтроля)
	|	И Ключи.НачалоПериодаКонтроля >= ПараметрыЛимитирования.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	Ключи.Ссылка,
	|	Ключи.Ссылка.ВидБюджета,
	|	Ключи.Ссылка.АналитикаПланированияСтатейБюджетов.СтатьяБюджета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПараметрыЛимитированияГруппыСтатей.Период КАК Период,
	|	ПараметрыЛимитированияГруппыСтатей.ВидБюджета КАК ВидБюджета,
	|	ПараметрыЛимитированияГруппыСтатей.ГруппаСтатей КАК ГруппаСтатей,
	|	ПараметрыЛимитированияГруппыСтатейСостав.СтатьяБюджета КАК СтатьяБюджета,
	|	ПараметрыЛимитированияГруппыСтатей.ИноеДействие КАК ИноеДействие,
	|	ПараметрыЛимитированияГруппыСтатей.КонтрольЛимитов КАК КонтрольЛимитов
	|ПОМЕСТИТЬ ВТ_ПараметрыЛимитированияГруппыСтатей
	|ИЗ
	|	РегистрСведений.ПараметрыЛимитированияГруппыСтатей КАК ПараметрыЛимитированияГруппыСтатей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыЛимитированияГруппыСтатейСостав КАК ПараметрыЛимитированияГруппыСтатейСостав
	|		ПО ПараметрыЛимитированияГруппыСтатей.Период = ПараметрыЛимитированияГруппыСтатейСостав.Период
	|			И ПараметрыЛимитированияГруппыСтатей.ВидБюджета = ПараметрыЛимитированияГруппыСтатейСостав.ВидБюджета
	|			И ПараметрыЛимитированияГруппыСтатей.ГруппаСтатей = ПараметрыЛимитированияГруппыСтатейСостав.ГруппаСтатей
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_КлючиКонтроляСНачаломДействия.КлючКонтроля КАК КлючКонтроля,
	|	ВТ_КлючиКонтроляСНачаломДействия.ВидБюджета КАК ВидБюджета,
	|	ВТ_КлючиКонтроляСНачаломДействия.ОбъектКонтроля КАК ОбъектКонтроля,
	|	ВЫБОР
	|		КОГДА ВТ_ПараметрыЛимитированияГруппыСтатей.ИноеДействие = ИСТИНА
	|			ТОГДА ВТ_ПараметрыЛимитированияГруппыСтатей.КонтрольЛимитов
	|		КОГДА СтатьиБюджета.ИноеДействие = ИСТИНА
	|			ТОГДА СтатьиБюджета.КонтрольЛимитов
	|		ИНАЧЕ ВидыБюджетов.КонтрольЛимитов
	|	КОНЕЦ КАК КонтрольЛимитов
	|ИЗ
	|	ВТ_КлючиКонтроляСНачаломДействия КАК ВТ_КлючиКонтроляСНачаломДействия
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыЛимитирования КАК ВидыБюджетов
	|		ПО ВТ_КлючиКонтроляСНачаломДействия.ВидБюджета = ВидыБюджетов.ВидБюджета
	|			И ВТ_КлючиКонтроляСНачаломДействия.НачалоДействия = ВидыБюджетов.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыКонтроляЛимитаСтатейБюджетов КАК СтатьиБюджета
	|		ПО ВТ_КлючиКонтроляСНачаломДействия.ВидБюджета = СтатьиБюджета.ВидБюджета
	|			И ВТ_КлючиКонтроляСНачаломДействия.НачалоДействия = СтатьиБюджета.Период
	|			И ВТ_КлючиКонтроляСНачаломДействия.ОбъектКонтроля = СтатьиБюджета.СтатьяБюджета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПараметрыЛимитированияГруппыСтатей КАК ВТ_ПараметрыЛимитированияГруппыСтатей
	|		ПО ВТ_КлючиКонтроляСНачаломДействия.ВидБюджета = ВТ_ПараметрыЛимитированияГруппыСтатей.ВидБюджета
	|			И ВТ_КлючиКонтроляСНачаломДействия.НачалоДействия = ВТ_ПараметрыЛимитированияГруппыСтатей.Период
	|			И (ВЫБОР
	|				КОГДА ВТ_КлючиКонтроляСНачаломДействия.ОбъектКонтроля ССЫЛКА Справочник.ГруппыСтатейБюджета
	|					ТОГДА ВТ_КлючиКонтроляСНачаломДействия.ОбъектКонтроля = ВТ_ПараметрыЛимитированияГруппыСтатей.ГруппаСтатей
	|				ИНАЧЕ ВТ_КлючиКонтроляСНачаломДействия.ОбъектКонтроля = ВТ_ПараметрыЛимитированияГруппыСтатей.СтатьяБюджета
	|			КОНЕЦ)
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ВТ_ПараметрыЛимитированияГруппыСтатей.ИноеДействие = ИСТИНА
	|				ТОГДА ВТ_ПараметрыЛимитированияГруппыСтатей.КонтрольЛимитов
	|			КОГДА СтатьиБюджета.ИноеДействие = ИСТИНА
	|				ТОГДА СтатьиБюджета.КонтрольЛимитов
	|			ИНАЧЕ ВидыБюджетов.КонтрольЛимитов
	|		КОНЕЦ = ЗНАЧЕНИЕ(Перечисление.РежимыКонтроляДокументов.Блокировать)";
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

Процедура ПриЗагрукзеРезультатовКонтроля(ВсеДанныеКонтроля) Экспорт
	
	РезультатКонтроляЛимитов = ВсеДанныеКонтроля[ПланыВидовХарактеристик.ВидыКонтроляДокументов.КонтрольБюджетныхЛимитов];
	Если РезультатКонтроляЛимитов = неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяКолонки = "ЗарезервированоИзменениеПревышениеТекущегоРезерва";
	Если РезультатКонтроляЛимитов.Колонки.Найти(ИмяКолонки) = неопределено Тогда
		РезультатКонтроляЛимитов.Колонки.Добавить(ИмяКолонки, Метаданные.ОпределяемыеТипы.ДенежнаяСуммаЛюбогоЗнака.Тип);
	КонецЕсли;
	
	РезультатКонтроляРезервов = ВсеДанныеКонтроля[ПланыВидовХарактеристик.ВидыКонтроляДокументов.КонтрольБюджетныхРезервов];
	Если РезультатКонтроляРезервов = неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РассчитатьПревышениеРезерва(РезультатКонтроляЛимитов, РезультатКонтроляРезервов);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьОбластиОтчета(Макет, ИмяОбласти, ИспользоватьРезервированиеФО = Истина);
	
	Результат = Новый Структура("Начало, До_Свободно, До, ТО_Итог, ТО, ИзРезерва, После_Свободно, После");
	Результат.Начало = Макет.ПолучитьОбласть(ИмяОбласти+"|"+"Начало");
	Результат.ДО_Свободно = Макет.ПолучитьОбласть(ИмяОбласти+"|"+"ДО_Свободно");
	Результат.ДО = Макет.ПолучитьОбласть(ИмяОбласти+"|"+"ДО");
	Результат.ТО_Итог = Макет.ПолучитьОбласть(ИмяОбласти+"|"+"ТО_Итог");
	Результат.ТО = Макет.ПолучитьОбласть(ИмяОбласти+"|"+"ТО");
	Если ИспользоватьРезервированиеФО Тогда
		Результат.ИзРезерва = Макет.ПолучитьОбласть(ИмяОбласти+"|"+"ИзРезерва");
	КонецЕсли;
	Результат.После_Свободно = Макет.ПолучитьОбласть(ИмяОбласти+"|"+"После_Свободно");
	Результат.После = Макет.ПолучитьОбласть(ИмяОбласти+"|"+"После");
	Возврат Результат;
	
КонецФункции

Процедура ВывестиОбластиОтчета(ТабДок, СтруктураМакетов, УровеньСтроки = 0, ИспользоватьРезервированиеФО = Истина)
	
	ТабДок.Вывести(СтруктураМакетов.Начало, УровеньСтроки);
	ТабДок.Присоединить(СтруктураМакетов.До_Свободно);
	ТабДок.НачатьГруппуКолонок("ДО", Ложь);
	ТабДок.Присоединить(СтруктураМакетов.До);
	ТабДок.ЗакончитьГруппуКолонок();
	ТабДок.Присоединить(СтруктураМакетов.ТО_Итог);
	ТабДок.НачатьГруппуКолонок("ТО", Ложь);
	ТабДок.Присоединить(СтруктураМакетов.ТО);
	ТабДок.ЗакончитьГруппуКолонок();
	Если ИспользоватьРезервированиеФО Тогда
		ТабДок.Присоединить(СтруктураМакетов.ИзРезерва);
	КонецЕсли;
	ТабДок.Присоединить(СтруктураМакетов.После_Свободно);
	ТабДок.НачатьГруппуКолонок("После", Ложь);
	ТабДок.Присоединить(СтруктураМакетов.После);
	ТабДок.ЗакончитьГруппуКолонок();
	
КонецПроцедуры

Процедура ЗаполнитьСуммыВОбласти(ОбластьОтчета, Данные, ИспользоватьРезервированиеФО = Истина, Документ)
	
	ЭтоДокументРезервирования = ТипЗнч(Документ) = Тип("ДокументСсылка.Резервирование");
	
	// Расчет
	ДоступноДо = Окр(Данные.Лимит, 2) - Окр(Данные.Зарезервировано, 2) - Окр(Данные.Заявлено, 2) - Окр(Данные.Исполнено, 2);
	Если Окр(Данные.ЗаявленоИзменение, 2) > 0 И Окр(Данные.ЗарезервированоИзменение, 2) < 0 Тогда
		// Это заявка по резерву
		ТекущаяОперация = - Окр(Данные.ЗаявленоИзменение, 2);
		ТекущаяОперацияПревышениеРезерва = Окр(Данные.ЗарезервированоИзменениеПревышениеТекущегоРезерва, 2);
		ТекущаяОперацияИзРезерва = Окр(Данные.ЗарезервированоИзменение, 2) - Окр(ТекущаяОперацияПревышениеРезерва, 2);
	ИначеЕсли Окр(Данные.ЗарезервированоИзменение, 2) < 0 Тогда
		Если ЭтоДокументРезервирования Тогда
			//Это уменьшение в документе "Резервирование" 
			ТекущаяОперация = - Окр(Данные.ЗарезервированоИзменение, 2);
			ТекущаяОперацияПревышениеРезерва = 0;
			ТекущаяОперацияИзРезерва = 0;
		Иначе
			//Это операция из резерва в резерв
			ТекущаяОперация = Окр(Данные.ЗарезервированоИзменение, 2);
			ТекущаяОперацияПревышениеРезерва = Окр(Данные.ЗарезервированоИзменениеПревышениеТекущегоРезерва, 2);
			ТекущаяОперацияИзРезерва = Окр(Данные.ЗарезервированоИзменение, 2) - Окр(ТекущаяОперацияПревышениеРезерва, 2);
		КонецЕсли;
	Иначе
		ТекущаяОперация = Окр(Данные.ЛимитИзменение, 2) - Окр(Данные.ЗарезервированоИзменение, 2) - Окр(Данные.ЗаявленоИзменение, 2) - Окр(Данные.ИсполненоИзменение, 2);
		ТекущаяОперацияИзРезерва = 0;
		ТекущаяОперацияПревышениеРезерва = 0;
	КонецЕсли;
	
	ДоступноПосле = ДоступноДо + ТекущаяОперация - ТекущаяОперацияИзРезерва;
	
	// Заполнение областей
	ОбластьОтчета.Начало.Параметры.Заполнить(Данные);
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ОбластьОтчета.Начало.Параметры, "СтрАналитики") Тогда
		ОбластьОтчета.Начало.Параметры.СтрАналитики = КонтрольУХ.ПолучитьПредставлениеАналитикСтатьиБюджета(Данные);
	КонецЕсли;
	
	//
	ОбластьОтчета.До_Свободно.Параметры.Лимит = ДоступноДо;
	ОбластьОтчета.До.Параметры.Заполнить(Данные);
	//
	ОбластьОтчета.ТО_Итог.Параметры.ТекущаяОперация = ТекущаяОперация;
	ОбластьОтчета.ТО.Параметры.ЛимитИзменение = Данные.ЛимитИзменение;
	ОбластьОтчета.ТО.Параметры.ЗаявленоИзменение = Данные.ЗаявленоИзменение;
	ОбластьОтчета.ТО.Параметры.ИсполненоИзменение = Данные.ИсполненоИзменение;
	//
	ОбластьОтчета.После_Свободно.Параметры.Доступно =  ДоступноПосле;
	ОбластьОтчета.После.Параметры.ЛимитИсх = Данные.Лимит + Данные.ЛимитИзменение;
	ОбластьОтчета.После.Параметры.ЗаявленоИсх = Данные.Заявлено + Данные.ЗаявленоИзменение;
	ОбластьОтчета.После.Параметры.ИсполненоИсх = Данные.Исполнено + Данные.ИсполненоИзменение;
	
	Если ИспользоватьРезервированиеФО Тогда
		ОбластьОтчета.ТО.Параметры.ЗарезервированоИзменение = Данные.ЗарезервированоИзменение;
		
		ОбластьОтчета.ИзРезерва.Параметры.ТекущаяОперацияИзРезерва = ТекущаяОперацияИзРезерва;
		ОбластьОтчета.ИзРезерва.Параметры.ТекущаяОперацияПревышениеРезерва = ТекущаяОперацияПревышениеРезерва;
		
		ОбластьОтчета.После.Параметры.ЗарезервированоИсх = Данные.Зарезервировано + Данные.ЗарезервированоИзменение - ТекущаяОперацияИзРезерва;
	КонецЕсли;
	
КонецПроцедуры

Процедура РассчитатьПревышениеРезерва(РезультатКонтроляЛимитов, РезультатКонтроляРезервов)
	
	Если РезультатКонтроляРезервов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из РезультатКонтроляЛимитов Цикл
		Строка.ЗарезервированоИзменениеПревышениеТекущегоРезерва =
			ПолучитьПревышениеРезерваПоСтроке(Строка, РезультатКонтроляРезервов);
	КонецЦикла;  
	
КонецПроцедуры

Функция ПолучитьПревышениеРезерваПоСтроке(Строка, РезультатКонтроляРезервов)
	
	Результат = 0;
	
	Если Строка.ЗарезервированоИзменение >= 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	Реквизиты = "ВидБюджета, Валюта, НачалоПериодаКонтроля, ПериодичностьКонтроля, ЦФО, Проект, СтатьяБюджета, "+АналитикиСтатейБюджетовУХКлиентСервер.РеквизитыАналитикИзШаблона("Аналитика%1");
	СтруктураПоиска = Новый Структура(Реквизиты);
	ЗаполнитьЗначенияСвойств(СтруктураПоиска, Строка);
	
	СтрокиРезерва = РезультатКонтроляРезервов.НайтиСтроки(СтруктураПоиска);
	Для Каждого СтрокаРезерва Из СтрокиРезерва Цикл
		
		Если СтрокаРезерва.ЗарезервированоИзменение >= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаРезерва.Зарезервировано > 0 Тогда
			Свободно = СтрокаРезерва.Зарезервировано;
		Иначе
			Свободно = 0;
		КонецЕсли;
		Дельта = Свободно + СтрокаРезерва.ЗарезервированоИзменение;
		Если Дельта < 0 Тогда
			Результат = Результат + Дельта;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
